<template>
    <div class="contract-box">
        <div class="contract">
            <div class="contract-title">借款服务协议</div>
            <!--开始 合同编号-->
            <div class="contract-serial">合同编号:{{resMap.pact_no}}</div>
            <div class="contr-text">
                <div>提示：</div>
                <p>如您或您的代理人已经成功注册为杭州金石互联网金融服务有限公司服务平台（www.weijinshi.com）或/和本公司客户端软件（微金石APP和微金石微信公众号）（以下统称“微金石平台”）用户，并愿意出借资金或借入资金，从而在出借方与借款方之间建立了民间借贷关系，您须阅读并确认、同意本协议全部条款。
                </p>
                <p>如您意欲出借资金，您须符合微金石平台《微金石用户服务协议》等所规定出借方的相关条件，并须事先在微金石平台完成注册。</p>
                <p>本协议为电子合同，您或您的代理人在微金石平台进行资金借出或资金借入操作前应阅读和知晓本协议全部内容，您或您的代理人进行下一步操作即视为您已经阅读并同意本协议条款且愿意受其约束和按其约定进行相关交易。
                </p>
                <p>本协议的借贷双方均确认，自主交易、自担风险，微金石不对借贷双方的信息真实性和还款能力、履约能力提供任何保证或其他责任。
                </p>
            </div>
            <div class="deal">
                <p>协议正文：</p>
                <div class="">
                    <p>甲方（借款方）：</p>
                    <table border="1">
                        <thead>
                        <tr>
                            <th>姓名</th>
                            <th>身份证号</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr v-for="item in resMap.wPlanBorrowInfos" :key="item.id">
                            <td>{{item.realName}}</td>
                            <td>{{item.idNumer}}</td>
                        </tr>
                        </tbody>
                    </table>
                </div>
                <div class="">
                    <p>借款方之代理人：</p>
                    <p>杭州霖汐网络科技有限公司</p>
                    <p>统一社会信用码：91330109MA2B0ATH1P</p>
                </div>
                <div class="">
                    <p>乙方（出借方）：</p>
                    <p>出借人姓名：{{resMap.realName}}</p>
                    <p>出借人身份证号：{{resMap.idNumber}}</p>
                    <p>出借人微金石注册账号：{{resMap.name}}</p>
                </div>
                <div class="">
                    <p>居间方：</p>
                    <p>杭州金石互联网金融服务有限公司（以下简称“微金石”）</p>
                    <p>统一社会信用码：91330106MA27W1A91N</p>
                </div>
            </div>
            <div class="contr-text">
                <div>鉴于：</div>
                <p>1、微金石是一家依法成立并有效存续的有限责任公司，拥有微金石平台的经营权，向微金石平台注册用户提供咨询及相关管理服务。</p>
                <p>2、借款方根据相关约定，全权委托其代理人杭州霖汐网络科技有限公司即借款方之代理人通过微金石平台申请借款及还款事宜，借款人之代理人和出借方均已在微金石平台注册，同意微金石平台的《微金石用户服务协议》，并自愿根据《微金石用户服务协议》达成并签订本协议。本协议借款方（或借款方之代理人）和出借方事先已充分阅读并认可微金石平台提供的投资/借款协议样本。
                </p>
                <p>3、借款方和出借方均已承诺其提供给微金石的所有信息真实、完整、有效。
                </p>
                <p>4、借款方具有合法的借款需求，出借方自愿以其自有的合法资金向借款方提供借款。出借方以本协议为依据与借款方形成真实、合法、有效的债权债务关系。
                </p>
                <p>为此，借款方之代理人和出借方基于平等自愿原则，经微金石的居间撮合，就有关借款事项达成如下协议，以兹共守：</p>
                <div class="tit">一、 借款基本信息：</div>
                <p>（一）出借方：指在微金石平台注册，并通过微金石平台而促成的实现资金出借且具有完全民事权利和行为能力的自然人或组织机构（依据《中华人民共和国公司法》依法设立并存续的，在中国大陆地区合法开展经营活动的法人及其他组织，下同）。</p>
                <p>（二）借款方：指由微金石平台促成的、与出借方签署借款协议，从而得到出借方出借资金且具有完全民事权利和行为能力的自然人或组织机构。
                </p>
                <p>（三）借款用途：资金周转。</p>
                <p>（四）借款金额：
                </p>
                <div class="deal">
                    <table border="1">
                        <thead>
                        <tr>
                            <th>姓名</th>
                            <th>身份证号</th>
                            <th>借款总额（元）</th>
                            <th>出借金额（元）</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr v-for="item in resMap.wPlanBorrowInfos" :key="item.id">
                            <td>{{item.realName}}</td>
                            <td>{{item.idNumer}}</td>
                            <td>{{item.amount}}</td>
                            <td>{{item.investAmount}}</td>
                        </tr>
                        </tbody>
                    </table>
                </div>
                <p>（五）借款期限：{{resMap.period_num}} {{resMap.period_unit}}。
                </p>
                <p>（六）借款利率：借款利率{{resMap.apr}}%。
                </p>
                <p>（七）加息利率：活动加息{{resMap.addApr}}%，加息券利率{{resMap.addRateApr}}%。
                </p>
                <p>（八）借款开始日（起息日）：微金石平台将资金划付至借入方在微金石平台开设的电子账户之日，或者微金石将资金划付至借款方指定的微金石平台的账户之日。本协议下借款开始日为 {{resMap.release_date}}。
                </p>
                <p>（九）借款到期日：借款期限届满之日，节假日不顺延(如到期当月不存在该借款开始日的对应日的，则应为当月的最后一日)。本协议下借款到期日为 {{resMap.last_repay_time}}。
                </p>
                <p>（十）还款方式：{{resMap.repayment_type}}。
                </p>
                <p>1、到期一次性还本付息，按天计息，日利率=年利率/360，还款日为到期日。</p>
                <p>2、到期一次性还本付息，按月计息，月利率=年利率/12，还款日为到期日。
                </p>
                <p>3、等额本息还款法，月利率=年利率/12，还款日为自第二个月起每个自然月的借款开始日的对应日，节假日不顺延(如当月不存在该借款开始日的对应日的，则应为当月的最后一日)。</p>
                <p>4、等额本金还款法，月利率=年利率/12，还款日为自第二个月起每个自然月的借款开始日的对应日，节假日不顺延(如当月不存在该借款开始日的对应日的，则应为当月的最后一日)。</p>
                <p>5、 先息后本（按月付息，到期结清本息），付息日为自第二个月起每个自然月的借款开始日的对应日，节假日不顺延(如当月不存在该借款开始日的对应日的，则应为当月的最后一日)。每月的利息部分=借款本金×年利率/12，到期日归还本金及当期利息(如当月不存在该借款开始日的对应日的，则应为当月的最后一日)。
                </p>
                <div class="tit">二、借款支付及还款：
                </div>
                <p>（一）出借方在同意向借款方出借相应款项时，出借方同意并授权新浪支付根据本协议约定从其电子账户中划转借款金额至借款方的指定电子账户以履行放款义务。出借方应确保在划转之时其电子账户中有足够的资金以完成放款。</p>
                <p>（二）借款方在还款时，借款方应于本协议约定的还款日24：00前完成还款。因第三方支付造成资金到账延迟的，微金石不承担任何责任。还款明细见附件《还款计划表》。</p>
                <p>（三）借款方和出借方均同意微金石接受委托的行为，由此所产生的法律后果均由相应委托方承担。</p>
                <p>（四）借款方承诺按照本协议约定的时间和金额按期足额向出借方还款。借款方将主动根据本协议规定之还款日及还款数额按月还款至其在微金石平台的平台账户（含借款方自行指定的收款的微金石平台账户），并委托微金石平台划付至出借方在微金石平台的平台账户。借款方的最后一期还款必须包含全部剩余本金、利息及所有根据本协议产生的其他费用等。
                </p>
                <p>本协议签订后，出借人不得将其债权进行全部或部分转让给第三人。</p>
                <div class="tit">三、债权转让：</div>
                <p>本协议签订后，出借人不得将其债权进行全部或部分转让给第三人。</p>
                <div class="tit">四、通知：</div>
                <p>（一）在本协议正常履行和借贷未逾期或违约的情形下，借贷双方无须向对方以任何形式发出通知或进行联络，均通过微金石平台相应操作进行联络。
                </p>
                <p>（二）在出现贷款逾期的情形下，且微金石不再负责清收并由出借方直接清收时，微金石有权将借款方的相关信息和联络方式告知出借方，其有权向借款方直接发出通知和/或文件均应以书面形式做出，通过专人送达、挂号邮递、特快专递、短信及邮件等方式传送。
                </p>
                <p>（三）借贷双方有权在任何时候更改其联系信息，但应按本协议约定的送达方式在变更后三个工作日内向其他方送达通知。否则变更方应当承担由此造成的不能送达所产生的法律风险及责任，向原先地址发送的通知及信函或法律文书等文件均视为已经送达。</p>
                <div class="tit">五、借款居间服务</div>
                <p>（一）微金石为借贷双方提供交易信息、信用咨询、评估、划款提醒、账户管理、还款特殊情况沟通等系列相关服务，同时借贷双方授权微金石作为双方借贷业务办理的管理方，有权监督借贷双方按照本协议及微金石平台规定进行操作，并在相应约定情形下拨付、收取及对外支付相应款项。
                </p>
                <p>（二）微金石为借款方提供的咨询和管理服务（包括交易信息、信用咨询、评估、还款提醒、账户管理、还款特殊情况沟通等系列相关服务），借款方同意在借款成功时向微金石支付服务居间费用，具体费用借款方和微金石另行商定。同时，借款方委托微金石从其在微金石平台开设的账户中直接扣除按商定的服务居间费用。</p>
                <p>（三）微金石作为居间服务方，微金石不对借款方的资信、还款能力等提供任何担保或承担连带或赔偿责任。</p>
                <div class="tit">六、提前还款</div>
                <p>借款方提前偿还借款的，提前还款部分按本协议约定的费率和实际占用天数计收利息。</p>
                <div class="tit">七、 逾期还款</div>
                <p>（一）借款方应严格履行还款义务，借款方未于借款协议规定的还款日前足额还款的，则需从还款日之次日起按如下约定向出借方支付逾期违约金。违约金计算方式：违约金总额 = 逾期应还款金额 × {{resMap.overdue_amount_rate}}% × 逾期天数。
                </p>
                <p>（二）若借款方逾期支付任何一期还款，微金石有权将借款方信息通过网站“逾期借款方名单”进行公布，并/或记入相关合作方的信用记录以及国家和地方的公民征信系统；由于信息公布产生的一切相关法律责任及后果概由借款方自负，与出借方及网站无涉。
                </p>
                <p>（三）若借款方逾期支付任何一期还款超过90天或借款方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，经微金石确认，本协议项下的全部借款本息视同提前到期，借款方应立即清偿本协议项下尚未偿付的全部本金、利息、逾期违约金及根据本协议产生的其他全部费用。
                </p>
                <p>（四）若借款方逾期支付任何一期还款超过90天，或借款方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，经微金石确认，出借方与微金石均可将借款方违约失信的相关信息及借款方其他信息向媒体、用人单位、公安机关、检查机关、法律机关等披露，并有权将借款方提交或微金石自行收集的借款方的个人资料和信息与任何第三方进行数据共享，以便出借方、微金石和第三方催收逾期借款及对用户的其他申请进行审核之用，由此造成的损失，出借方与微金石不承担任何责任。
                </p>
                <p>（五）为集中维护各出借方权利，如借款方出现逾期还款90天，或借款方在逾期后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为的，全体出借方一致同意将本协议项下债权无偿转让给微金石，由微金石统一向借款方追索。如果微金石通过诉讼方式追索的，出借方还应向微金石缴纳相应的包括但不限于诉讼保全费用、律师费用及诉讼费用等。
                </p>
                <p>但因借款方失踪或还款能力丧失等原因导致债权的追索不能实现或部分不能现实的，本协议项下债权经微金石书面通知出借方后重新转让还给出借方。同时，出借方应当承担因债权无法追索产生的一切损失。</p>
                <p>（六）出借方一致同意，经追索实现的债权款项，借款方应当全额支付至其在微金石的平台账户，并在扣除微金石为实现债权支付的相关费用，包括但不限于诉讼保全费用、律师费用及诉讼费用后，按各债权人的债权比例向出借方进行支付。如经追索实现的债权不足以偿还本协议项下约定的本金、利息及违约金的，在扣除为实现债权支付的相关费用，包括但不限于诉讼保全费用、律师费用及诉讼费用后，出借方同意各自按照其借出款项比例收取本金、利息及罚息。</p>
                <p>（七）借款方的个人信息或工作情况发生重大变动，可能影响借款方按时还款的，借款方应于发生前述变更后的5个工作日内书面通知出借方与微金石该种逾期可能。
                </p>
                <div class="tit">八、授权条款</div>
                <p>甲方自愿参加本次出借计划，为了微金石能够更好的向甲方提供服务，甲方同意在本协议约定的范围内全权委托微金石为其提供智能匹配债权，并授权微金石在本协议约定的债权范围内利用技术手段，生成的相关借款协议或债权转让协议等，甲方认可前述各述协议对其有效，并承诺按照协议约定享有权利及履行义务。</p>
                <div class="tit">九、违约责任</div>
                <p>（一）本协议各方均应严格履行协议义务，任何一方违约，违约方应承担因违约使其他各方产生的费用和损失，包括但不限于调查费、诉讼费、律师费等。
                </p>
                <p>（二）各方同意，若出现如下任何一种情况，本协议项下的全部借款本息自动提前到期，借款方应立即清偿本协议项下尚未偿付的全部本金、利息、逾期违约金及根据本协议产生的其他全部费用：
                </p>
                <p>1、借款方因任何原因逾期【90】天的；</p>
                <p>2、借款方个人信息或工作情况发生重大变动后的10个工作日内未书面通知出借方与微金石的；
                </p>
                <p>3、借款方在逾期偿还借款后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为的；</p>
                <p>4、借款方违反本协议其他约定的。</p>
                <p>（三）借款方的逾期还款均应按照如下顺序清偿：</p>
                <p>1、根据本协议产生的与催收相关的费用；
                </p>
                <p>2、逾期违约金。</p>
                <p>3、利息；</p>
                <p>4、本金。</p>
                <p>（四）出借方和微金石为实现本合同债权的所涉及的全部费用（包括但不限于诉讼费、差旅费、律师费、公告费、执行费、过户费等）及由此造成的其他损失，均应由借款方承担。
                </p>
                <div class="tit">十、相关承诺与安排：</div>
                <p>（一）借款方承诺向微金石和出借方提交的一切文本、图文、个人信息等资料等均为真实、有效。</p>
                <p>（二）一旦借款方项目中止或失败，借款方需提前还款从而终止借款方与出借方的借贷关系。</p>
                <p>（三）未经微金石与全部出借方的一致同意，借款方不得以任何理由和任何形式将获得的借款用于前述借款用途之外的任何其他用途。</p>
                <p>（四）借款方和出借方承诺任何发自借款方和出借方注册时提供的邮箱、手机的电子邮件与短信均为借款方和出借方的真实意思表示。</p>
                <div class="tit">十一、适用法律及争议解决：</div>
                <p>本协议的签订、履行、终止、解释均适用中华人民共和国法律，并由微金石所在地人民法院诉讼解决。</p>
                <div class="tit">十二、其他事项：</div>
                <p>（一）借款方的借款需求与出借方的投资需求匹配成功，即一个或多个出借方愿意提供出借的资金等于或大于借款方的借款需求后【2】日内，借款方无法撤销借款。</p>
                <p>（二）微金石发布的相应标的筹资需求未在10个工作日内被全部满足并已经适当冻结相应拟出借资金的，则自第10个工作日24：00起，本协议自动终止，微金石平台于两个工作日内将冻结款项划至或返还出借方在微金石平台开设的账户。</p>
                <p>（三）借款方的筹款金额到期未达到流标，无需向出借方支付利息。
                </p>
                <p>（四）本协议采用电子文本形式制成，并在微金石平台上保留存档，各方均认可该形式协议的法律效力。
                </p>
                <p>（五）借款方及出借方均同意微金石根据具体情况对本借款协议进行更新，更新后的条款对双方均有拘束力。</p>
                <p>（六） 如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</p>
                <p>（七）出借方通过该借款协议所获得的收益应自行申报并缴纳税款。
                </p>
                <p>（八）微金石接受借款方和出借方的委托所产生的法律后果由相应委托方承担。如因借款方或出借方或其他第三方（包括但不限于技术问题）造成的延误或错误，微金石不承担任何责任。</p>
                <p>（九）本协议经出借方与借款方双方通过微金石平台自主操作后，自动生成电子合同，为双方同意和认可。本协议自生成之日起生效。
                </p>
                <p>（十）借款方和出借方签署和确认的《微金石用户服务协议》为本协议有效组成部分。</p>
            </div>
            <div class="deal">
                <p>[ 本行以下无正文] ：</p>
                <div class="">
                    <p>借款方：见上面借款人列表</p>
                </div>
                <div class="">
                    <p>借款方之代理人：</p>
                    <p>杭州霖汐网络科技有限公司</p>
                    <p>统一社会信用码：91330109MA2B0ATH1P</p>
                </div>
                <div class="">
                    <p>出借方：</p>
                    <p>出借人姓名：{{resMap.realName}}</p>
                    <p>出借人身份证号：{{resMap.idNumber}}</p>
                    <p>出借人微金石注册账号：{{resMap.name}}</p>
                </div>
                <div class="">
                    <p>居间方：</p>
                    <p>杭州金石互联网金融服务有限公司（以下简称“微金石”）</p>
                    <p>统一社会信用码：91330106MA27W1A91N</p>
                </div>
                <div>
                    <p>附表：还款计划表</p>
                    <table border="1">
                        <thead>
                        <tr>
                            <th>还款日期</th>
                            <th>应还本息(元)</th>
                            <th>应还本金（元）</th>
                            <th>应还利息（元）</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr v-for="item in resMap.repayProtocalPlans" :key="item.id">
                            <td>{{item.repayTime}}</td>
                            <td>{{item.repayAmount}}</td>
                            <td>{{item.receiveCorpus}}</td>
                            <td>{{item.receiveInterest}}</td>
                        </tr>
                        <tr>
                            <td>合计</td>
                            <td>{{resMap.sumRepayAmount}}</td>
                            <td>{{resMap.sumReceiveCorpus}}</td>
                            <td>{{resMap.sumReceiveInterest}}</td>
                        </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <!--结束 合同编号-->
        </div>
    </div>
</template>

<script>
import { getLenddeal } from "@/api/app";
import { mBrowser } from "jrmf-utils";
export default {
  name: "lend-deal",
  data() {
    return {
      resMap: {}
    };
  },
  created() {
    let params = this.$getUrlArrayObj();
    getLenddeal(params).then(res => {
      if (res.code === 1) {
        this.resMap = res.data.wPlanProtocalData;
        this.UpdateTitle();
      }
    });
  },
  methods: {
    FormatStr(str) {
      if (!str) return;
      console.log(str);
      str += "";
      let leg = str.length;
      if (leg > 8) {
        let nums = leg - 8,
          nstr = "";
        for (let i = 0; i < nums; i++) {
          nstr += "*";
        }
        return str.substr(0, 4) + nstr + str.substr(4 + nums);
      }
      return str;
    },
    UpdateTitle() {
      let title = this.investDeal.title + "";
      if (title.indexOf("《") > -1) {
        console.log(title.length);
        title = title.substr(1, title.length - 2);
      }
      document.title = title;
      this.CallApp();
    },
    CallApp() {
      if (mBrowser.versions.android) {
        window.js_java_android.asyncDone();
      } else {
        this.$bridge.callhandler("asyncDone");
      }
    }
  }
};
</script>

<style scoped lang="less">
.contract-box {
  background-color: #fff;
  height: auto;
  min-height: 300px;
  width: 100%;
  padding: 24px;
  position: relative;
  margin: 0px auto 0;
}
table {
  width: 100%;
}
.deal > div {
  padding-top: 30px;
}
.contr-text {
  .tit {
    font-weight: bold;
  }
  p {
    padding-bottom: 32px;
  }
  div {
    padding: 32px 0px;
  }
}
.contract {
  height: auto;
  line-height: 48px;
  width: 100%;
  position: relative;
  font-size: 28px;
}
.contract-title {
  font-size: 36px;
  font-weight: bold;
  text-align: center;
  height: 60px;
  width: 100%;
  position: relative;
}
.contract-serial {
  font-size: 24px;
  line-height: 35px;
  color: #555555;
  text-align: right;
  height: 35px;
  width: 100%;
  position: relative;
}
</style>
